# YOLOv11 RGBT Lightweight Configuration
# Optimized for memory efficiency and training stability

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  #n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
 # m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
 # l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
 # x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# Channels
ch: 4  # RGB + IR channels

# YOLOv11 backbone
backbone:
  # RGB Backbone
  [-1, 1, Silence, []]  # 0-P1/2
  [[-1, 1], 1, Conv, [64, 3, 2]],  # 1-P1/2
  [[-1, 1], 1, Conv, [128, 3, 2]],  # 2-P2/4
  [[-1, 3], 1, C2f, [128, True]],
  [[-1, 1], 1, Conv, [256, 3, 2]],  # 4-P3/8
  [[-1, 6], 1, C2f, [256, True]],
  [[-1, 1], 1, Conv, [512, 3, 2]],  # 6-P4/16
  [[-1, 9], 1, C2f, [512, True]],
  [[-1, 1], 1, Conv, [1024, 3, 2]],  # 8-P5/32
  [[-1, 12], 1, C2f, [1024, True]],
  [[-1, 1], 1, SPPF, [1024, 5]],  # 10

  # IR Backbone (parallel)
  [[-1, 1], 1, SilenceChannel, [3]],  # 11-IR-P1/2
  [[-1, 1], 1, Conv, [64, 3, 2]],  # 12-IR-P1/2
  [[-1, 1], 1, Conv, [128, 3, 2]],  # 13-IR-P2/4
  [[-1, 3], 1, C2f, [128, True]],
  [[-1, 1], 1, Conv, [256, 3, 2]],  # 15-IR-P3/8
  [[-1, 6], 1, C2f, [256, True]],
  [[-1, 1], 1, Conv, [512, 3, 2]],  # 17-IR-P4/16
  [[-1, 9], 1, C2f, [512, True]],
  [[-1, 1], 1, Conv, [1024, 3, 2]],  # 19-IR-P5/32
  [[-1, 12], 1, C2f, [1024, True]],
  [[-1, 1], 1, SPPF, [1024, 5]],  # 21-IR

# YOLOv11 head
head:
  # P3/8 - Lightweight fusion
  [[-1, 6, 15], 1, LightweightCrossFusion, [1, 1]],  # cat backbone P3   22
  
  # P4/16 - Stable fusion
  [[-1, 9, 18], 1, StableCrossFusion, [1, 1]],  # cat backbone P4   23
  
  # P5/32 - Lightweight fusion
  [[-1, 10, 21], 1, LightweightCrossFusion, [1, 1]],  # cat backbone P5   24
  
  # Detection layers
  [[22, 23, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
