# YOLOv11 Enhanced Fusion Configuration
# 使用EnhancedCrossFusion模块进行红外光与可见光融合

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  #n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  #m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  #l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  #x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

ch: 4

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]  # 0-P1/2
    # visible
  - [0, 1, SilenceChannel, [0,3]]  # 1-P1/2
  - [ -1,1,ResNet50vd,[ 64,0 ] ]# 2
  - [ -1,1,ResNet50vd,[ 256,1 ] ]# 3
  - [ -1,1,ResNet50vd,[ 512,2 ] ]# 4
  - [ -1,1,ResNet50vd,[ 1024,3 ] ]# 5
  - [ -1,1,ResNet50vd,[ 2048,4 ] ]

  # infrared
  - [ 0, 1, SilenceChannel, [ 3,4 ] ]  # 7
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] # 12-P1/2
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 13-P2/4
  - [ -1, 2, C3k2, [ 256, False, 0.25 ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 15-P3/8
  - [ -1, 2, C3k2, [ 512, False, 0.25 ] ]
  - [ -1, 1, Conv, [ 512, 3, 2 ] ] # 17-P4/16
  - [ -1, 2, C3k2, [ 512, True ] ]
  - [ -1, 1, Conv, [ 1024, 3, 2 ] ] # 19-P5/32
  - [ -1, 2, C3k2, [ 1024, True ] ]  #20

  - [[5, 12], 1, LightweightCrossFusion, [1, 1]]
  - [[5, 14], 1, Concat, [1]]  # cat backbone P4   14
  - [[6, 16], 1, Concat, [1]]  # cat backbone P5   15

  - [ -1, 1, SPPF, [ 1024, 5 ] ] #
  - [ -1, 2, C2PSA, [ 1024 ] ] # 17

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 18], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [768, False]] # 20

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 17], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 23 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 24], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 26 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 21], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1536, True]] # 29 (P5/32-large)

  - [[27, 30, 33], 1, Detect, [nc]] # Detect(P3, P4, P5)